* An exporter for org to docx via pandoc

The idea here is to write a function that converts your org document to a word document using pandoc. There is not much we need to do, but we would like to convert citations to the format used by pandoc.

#+BEGIN_SRC emacs-lisp
(defun pandoc-cite-format (link contents info)
  (let ((type (org-element-property :type link))
	(path (org-element-property :path link)))
    (cond
     ((string= type "cite")
      (format "[%s]"
	      (mapconcat
	       (lambda (x) (concat "@" x))
	       (split-string path ",")
	       "; ")
	      ))
     ;; anything else, we just do the regular thing
     (t
      (org-html-link link contents info)))))

(org-export-define-derived-backend 'pandoc-docx 'org
  :translate-alist '((link . pandoc-cite-format)))
#+END_SRC


Here are some references to test [@needs-1989-calcul]. And a multiple reference.

[@jarvi-2008-devel-reaxf; @zhou-2004-first-lda-u; @curnan-2014-effec-concen]

This will export our file with converted links.
#+BEGIN_SRC emacs-lisp
(org-export-to-file (org-export-define-derived-backend 'pandoc-docx 'org
  :translate-alist '((link . pandoc-cite-format))) "some-filename.org")
#+END_SRC

So, we need to get the bibliography file from the org file.

(expand-file-name (car (org-ref-find-bibliography)))

#+BEGIN_SRC emacs-lisp
(shell-command "rm some-filename.docx")
(find-file (org-export-to-file 'pandoc-docx "some-filename.org"))
(shell-command (format "pandoc -s -S --biblio=%s %s -o %s"
		       (expand-file-name (car (org-ref-find-bibliography)))
		       (buffer-file-name)
		       (replace-regexp-in-string "\\.org" ".docx" (buffer-file-name))))
(shell-command (format "open %s" (replace-regexp-in-string "\\.org" ".docx" (buffer-file-name))))
#+END_SRC

#+RESULTS:
: 1

<a href="./some-filename.docx">./some-filename.docx</a>

<h1>Bibliography</h1>
<ul><li><a id="curnan-2014-effec-concen">[curnan-2014-effec-concen] Curnan \& Kitchin, Effects of Concentration, Crystal Structure,  Magnetism, and Electronic Structure Method on  First-Principles Oxygen Vacancy Formation Energy  Trends in Perovskites, <i>The Journal of Physical Chemistry C</i>, <b>118(49)</b>, 28776-28790 (2014). <a href="http://dx.doi.org/10.1021/jp507957n">link</a>. <a href="http://dx.doi.org/10.1021/jp507957n">doi</a>.</a></li>
<li><a id="jarvi-2008-devel-reaxf">[jarvi-2008-devel-reaxf] J\"arvi, Kuronen, Hakala, Nordlund, , van Duin, Goddard \& Jacob, Development of a Reaxff Description for Gold, <i>The European Physical Journal B</i>, <b>66(1)</b>, 75-79 (2008). <a href="http://dx.doi.org/10.1140/epjb/e2008-00378-3">link</a>. <a href="http://dx.doi.org/10.1140/epjb/e2008-00378-3">doi</a>.</a></li>
<li><a id="needs-1989-calcul">[needs-1989-calcul] Needs \& Mansfield, Calculations of the Surface Stress Tensor and Surface Energy  of the (111) Surfaces of Iridium, Platinum and Gold, <i>Journal of Physics: Condensed Matter</i>, <b>1(41)</b>, 7555-7563 (1989). <a href="http://dx.doi.org/10.1088/0953-8984/1/41/006">link</a>. <a href="http://dx.doi.org/10.1088/0953-8984/1/41/006">doi</a>.</a></li>
<li><a id="zhou-2004-first-lda-u">[zhou-2004-first-lda-u] Zhou, Cococcioni, Marianetti, Morgan, \& Ceder, First-Principles Prediction of Redox Potentials in  Transition-Metal Compounds With Lda+u, <i>Physical Review B</i>, <b>70(23)</b>, nil (2004). <a href="http://dx.doi.org/10.1103/PhysRevB.70.235121">link</a>. <a href="http://dx.doi.org/10.1103/physrevb.70.235121">doi</a>.</a></li>
</ul>
